#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # dnsimple_record.txt_hey_dmark will be created
  + resource "dnsimple_record" "txt_hey_dmark" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + name      = "_dmarc"
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "v=DMARC1; p=none;"
    }

  # dnsimple_record.txt_hey_spf will be created
  + resource "dnsimple_record" "txt_hey_spf" {
      + domain    = "nathanherald.com"
      + domain_id = (known after apply)
      + hostname  = (known after apply)
      + id        = (known after apply)
      + priority  = (known after apply)
      + ttl       = "3600"
      + type      = "TXT"
      + value     = "v=spf1 +a include:_spf.hey.com ~all"
    }

  # dnsimple_record.txt_soverin_spf will be destroyed
  - resource "dnsimple_record" "txt_soverin_spf" {
      - domain    = "nathanherald.com" -> null
      - domain_id = "nathanherald.com" -> null
      - hostname  = "nathanherald.com" -> null
      - id        = "5064660" -> null
      - priority  = "0" -> null
      - ttl       = "3600" -> null
      - type      = "TXT" -> null
      - value     = "v=spf1 +a include:soverin.net ~all" -> null
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>

*Workflow: `terraform`, Action: `hashicorpterraform-github-actions2`, Working Directory: `.`, Workspace: `default`*
